



// result.js
const cardImages = {
    'Card 1': 'image\\big-card\\Group 1.png',
    'Card 2': 'image\\big-card\\Group 2.png',
    'Card 3': 'image\\big-card\\Group 3.png',
    'Card 4': 'image\\big-card\\Group 4.png',
    'Card 5': 'image\\big-card\\Group 5.png',
    'Card 6': 'image\\big-card\\Group 6.png',
    'Card 7': 'image\\big-card\\Group 7.png',
    'Card 8': 'image\\big-card\\Group 8.png',
    'Card 9': 'image\\big-card\\Group 9.png',
    'Card 10': 'image\\big-card\\Group 10.png',
    'Card 11': 'image\\big-card\\Group 11.png',
    'Card 12': 'image\\big-card\\Group 12.png',
    'Card 13': 'image\\big-card\\Group 13.png',
    'Card 14': 'image\\big-card\\Group 14.png',
    'Card 15': 'image\\big-card\\Group 15.png',
    'Card 16': 'image\\big-card\\Group 16.png',
    'Card 17': 'image\\big-card\\Group 17.png',
    'Card 18': 'image\\big-card\\Group 18.png',
    'Card 19': 'image\\big-card\\Group 19.png',
    'Card 20': 'image\\big-card\\Group 20.png',
    'Card 21': 'image\\big-card\\Group 21.png',
    'Card 22': 'image\\big-card\\Group 22.png',
    'Card 23': 'image\\big-card\\Group 23.png',
    'Card 24': 'image\\big-card\\Group 24.png',
    'Card 25': 'image\\big-card\\Group 25.png',
    'Card 26': 'image\\big-card\\Group 26.png',
    'Card 27': 'image\\big-card\\Group 27.png',
    'Card 28': 'image\\big-card\\Group 28.png',
    'Card 29': 'image\\big-card\\Group 29.png',
    'Card 30': 'image\\big-card\\Group 30.png',
    'Card 31': 'image\\big-card\\Group 31.png',
    'Card 32': 'image\\big-card\\Group 32.png',
    'Card 33': 'image\\big-card\\Group 33.png',
    'Card 34': 'image\\big-card\\Group 34.png',
    'Card 35': 'image\\big-card\\Group 35.png',
    'Card 36': 'image\\big-card\\Group 36.png',
    'Card 37': 'image\\big-card\\Group 37.png',
    'Card 38': 'image\\big-card\\Group 38.png',
    'Card 39': 'image\\big-card\\Group 39.png',
    'Card 40': 'image\\big-card\\Group 40.png',
    'Card 41': 'image\\big-card\\Group 41.png',
    'Card 42': 'image\\big-card\\Group 42.png',
    'Card 43': 'image\\big-card\\Group 43.png',
    'Card 44': 'image\\big-card\\Group 44.png',
    'Card 45': 'image\\big-card\\Group 45.png',
    'Card 46': 'image\\big-card\\Group 46.png',
    'Card 47': 'image\\big-card\\Group 47.png',
    'Card 48': 'image\\big-card\\Group 48.png',
    'Card 49': 'image\\big-card\\Group 49.png',
};

const cardname = {
    'Card 1': 'АСЪ',
    'Card 2': 'БОГИ',
    'Card 3': 'ВѢДИ',
    'Card 4': 'ГЛАГОЛИ',
    'Card 5': 'ДОБРО',
    'Card 6': 'ЕСТЬ',
    'Card 7': 'ЕСМЬ',
    'Card 8': 'ЖИВОТЪ',
    'Card 9': 'SѢЛО',
    'Card 10': 'ZЕМЛЯ',
    'Card 11': 'ИЖЕ',
    'Card 12': 'ИЖЕИ',
    'Card 13': 'ИНИТЬ',
    'Card 14': 'ГЕРВЬ',
    'Card 15': 'КАКО',
    'Card 16': 'ЛЮДИ',
    'Card 17': 'МЫСЛИТЕ',
    'Card 18': 'НАШЪ',
    'Card 19': 'ОНЪ',
    'Card 20': 'ПОКОЙ',
    'Card 21': 'РЕЦЫ',
    'Card 22': 'СЛОВО',
    'Card 23': 'ТВЕРДО',
    'Card 24': 'УКЪ',
    'Card 25': 'ОУКЪ',
    'Card 26': 'ФЕРТ',
    'Card 27': 'ХѢРЪ',
    'Card 28': 'ОТЪ',
    'Card 29': 'ЦЕЛЬ',
    'Card 30': 'ЧЕРВЛЬ',
    'Card 31': 'ША',
    'Card 32': 'ШТА',
    'Card 33': 'ЕРЪ',
    'Card 34': 'ЕРЫ',
    'Card 35': 'ЕРЬ',
    'Card 36': 'ЯТЬ',
    'Card 37': 'ЮНЬ',
    'Card 38': 'АРЬ',
    'Card 39': 'ЭДО',
    'Card 40': 'ОМЪ',
    'Card 41': 'ЕНЪ',
    'Card 42': 'ОДЬ',
    'Card 43': 'ИОТА',
    'Card 44': 'ОТА',
    'Card 45': 'КСИ',
    'Card 46': 'ПСИ',
    'Card 47': 'ФИТА',
    'Card 48': 'ИЖИЦА',
    'Card 49': 'ИЖА',
};

const cardtitle = {
    'Card 1': 'Начни с себя, созидай',
    'Card 2': 'Обратись к Высшим Силам',
    'Card 3': 'Собирай знания, изучай',
    'Card 4': 'Двигайся, направляй, делись опытом',
    'Card 5': 'Накапливай, развивайся',
    'Card 6': 'Воплощай, материализуй',
    'Card 7': 'Внеси разнообразие, осознай себя',
    'Card 8': 'Меняйся, преображайся',
    'Card 9': 'Покоряй неизведанное, превзойди себя',
    'Card 10': 'Наполняйся силой на Родной Земле',
    'Card 11': 'Уравновешивай, гармонизируй',
    'Card 12': 'Загляни в себя',
    'Card 13': 'Действуй сообща',
    'Card 14': 'Удивляй, воодушевляй',
    'Card 15': 'Рассчитай, найди общее',
    'Card 16': 'Разветвляй отношения, знакомься',
    'Card 17': 'Обдумывай, размышляй',
    'Card 18': 'Приобщайся к Родному',
    'Card 19': 'Определи свои приоритеты',
    'Card 20': 'Остановись, взвесь, приготовься',
    'Card 21': 'Конкретизируй, отбрось лишнее',
    'Card 22': 'Согрей словом',
    'Card 23': 'Сохраняй стойкость, восстанавливай',
    'Card 24': 'Свяжись, спроси, встреться',
    'Card 25': 'Наведи порядок, организуй',
    'Card 26': 'Верь в себя и собственные силы',
    'Card 27': 'Умиротворяй, уравновешивай',
    'Card 28': 'Подведи итоги',
    'Card 29': 'Двигайся к своей цели',
    'Card 30': 'Знай меру',
    'Card 31': 'Выйди за рамки привычного',
    'Card 32': 'Оберегай, защищай',
    'Card 33': 'Продолжай действовать',
    'Card 34': 'Объединяй, сплачивай',
    'Card 35': 'Заверши незаконченные дела',
    'Card 36': 'Укрепи Божественную связь',
    'Card 37': 'Иди своим путём',
    'Card 38': 'Расширяй меру ответственности',
    'Card 39': 'Прикоснись, заимствуй, присоединяйся',
    'Card 40': 'Подходи к делу с Любовью',
    'Card 41': 'Установи смысл, найди причину',
    'Card 42': 'Перенимай опыт Предков',
    'Card 43': 'Углубляй знания',
    'Card 44': 'Делай по-своему',
    'Card 45': 'Выполняй своё предназначение',
    'Card 46': 'Открой своё сердце',
    'Card 47': 'Слейся с Природой',
    'Card 48': 'Прояви милосердие и доброту',
    'Card 49': 'Береги время',
};

const cardabout = {
    'Card 1': 'Найди свой интерес в жизни, он даст тебе новые силы. Обращай особое внимание на то, что тебя давно интересовало. Возможно, что-то казалось тебе не слишком полезным или имеющим мало отношения к реальной жизни, но с его помощью ты сможешь изменить не только себя, но и мир.',
    'Card 2': 'Размышляя о своих отношениях с Богами и Предками, важно помнить, что все испытания в нашей жизни даются для того, чтобы укрепить наш Дух и развить Душу. Мы можем просить Духовной поддержки или Душевной Силы, решимости или же понимания своего предназначения. Но мы не вправе просить материальных благ и всего того, что способны получить самостоятельно. Боги сами дадут то, что нам нужно, и тогда, когда нам это необходимо.',
    'Card 3': 'Ощущение счастья заключается в получении новых знаний, в осознании своего роста и развития. Будь смелым, пробуй то, что никогда не делал раньше — это поможет раскрыть в себе новые грани. Обогащая свой жизненный опыт, учись взаимодействовать со всем многообразием жизни. Благодаря этому ты сможешь расширить свое восприятие и в полной мере познавать более сложные Миры.',
    'Card 4': 'Хотеть недостаточно, надо действовать. Что бы ты ни делал, делай это. Делись знаниями, силами, временем, ресурсами. Учить — значит направлять. Передавай старое, чтобы получить новое. Не ищи света — свети! Дари Душевное тепло, приумножая радость в мире. И чем больше ты будешь давать, тем больше у тебя останется.',
    'Card 5': 'Приглядись, какие достижения нужно сохранить, а после — приумножить. Наслаждайся даже скромными своими результатами и не забывай делиться ими. Благосостояние растёт только в том случае, если твой ум находится в напряжении. Струны твоей Души должны быть натянуты, чтобы резонировать с Мирозданием. Если ты ослабляешь натяжение и не развиваешься, то могут наступить разлад, неурядицы и беды.',
    'Card 6': 'Перестань копаться в том, что уже произошло, и томиться о том, что ещё не случилось. Полностью прими настоящий момент с благодарностью и любовью. Необходимо радоваться каждому дню и наслаждаться каждым мгновением. Если хочешь что-то делать — делай! Не трать время на бесконечные расчёты и планирование. Подлинно важно то, что ты созидаешь в текущем моменте.',
    'Card 7': 'Выйди из привычных рамок рутинной жизни. Накапливай максимально разносторонний опыт, раскрывай свои возможности. Нет единственно правильного способа жить. Жизненный путь полезно рассматривать со всех сторон, а это значит неустанно и разнообразно действовать, всей силой воли стремясь к поставленной цели.',
    'Card 8': 'Разумей собственную ценность для Мира и свою уникальность. Будь таким, каким можешь, быть собой — это не значит замереть в существующем состоянии и остановиться в своем развитии. Быть собой — это постоянное преображение себя трудом и Любовью с целью создания желаемой действительности.',
    'Card 9': 'Прояви волю и сделай шаг в неизвестность с пустыми руками. Тебя ждёт испытание твоей Веры. Прорвавшись сквозь страх, ты никогда уже не будешь прежним. Имей смелость идти по велению сердца своего туда, где тебя ждёт насыщенная жизнь! Наберись мужества реализовать дарованные тебе возможности, невзирая на мнение или одобрение других людей.',
    'Card 10': 'Напои свою Душу силой Родных мест, где отдыхаешь сердцем. Куда бы ни несли тебя мечты, вернись к истокам - туда, где всё начиналось, где чувствуешь трепет Души. Вырвись на простор, подальше от суетных мыслей. Вновь пройди знакомыми путями и окунись в поток забытых светлых чувств. ',
    'Card 11': 'Какая из сторон твоей жизни сейчас требует особого внимания? Выясни, насколько она развита и что конкретно необходимо сделать для её улучшения? Найди способы поддерживать баланс во всех сферах жизни. Гармоничный человек не ищет любовь и поводы для радости. Он наполняет мир любовью и радостью, и в ответ они сами к нему приходят.',
    'Card 12': 'Не слишком увлекайся своими грёзами. Не трать уйму сил и времени на одни и те же мысли. Ты создаешь параллельные Вселенные, где уже произошло всё, о чем ты мечтаешь. А значит, в данной действительности это может не случиться. Лучше вложить основные силы в конкретные дела, которые приведут к результатам, а на планирование оставь десятую часть.',
    'Card 13': 'Наступает время сплочения, соратничества и командного взаимодействия. Необходимо научиться трудиться в согласии, доверять друг другу и ставить общие интересы на первый план, чтобы вместе достигать новых высоких целей и результатов. Взаимопомощь и взаимоподдержка необходимы нам, чтобы жить в соответствии с Духовными принципами.',
    'Card 14': 'И в этом тебе помогут твоя энергичность, уверенность и умение подать себя. Энергичность гораздо важнее, чем то, что ты хочешь донести. Укрепи Веру перед лицом неизвестности — это знание того, что все сработает как надо. Всегда верь в свой успех, несмотря на слова нытиков и недоброжелателей. Потому что уверенность, как и энергичность, передастся твоему окружению,и всё получится.',
    'Card 15': 'Спроси себя: для чего тебе сила, здоровье, время? Что ты будешь с ними делать, куда вкладывать? Чем больше масштаб видения себя и своего вклада в мир, тем больше возможностей. Главное, перестать экономить свои ресурсы и не бояться отдаться процессу движения с головой. В таком случае у тебя появится шанс на практике узнать ответ на вопрос: «Кто я?». Дерзай мечтать по-крупному! Сила дается на настоящее дело!',
    'Card 16': 'Впусти в свою жизнь новых людей – они раскроют для тебя невиданные прежде горизонты и помогут определиться с направлением движения. Увеличение круга общения приводит к тому, что мы расширяем круг своих интересов, обретаем судьбоносные встречи, а вслед за этим и новые возможности, которые могут изменить нашу жизнь в лучшую сторону.',
    'Card 17': 'Контролируй свои помыслы, направляй внимание на творчество и созидание. Чистое сознание, не отягощённое мрачными чувствами, притягивает новые идеи. Только в светлую голову приходят по-настоящему ценные мысли. Под конкретную идею даются и ресурсы, и силы для реализации будущего дела.',
    'Card 18': 'Найди способ извлечь из себя Родовую Мудрость. Ключи к нашим внутренним знаниям разбросаны по всему жизненному пути. Это могут быть интересные книги, встречи, ситуации – всё что угодно. Полезно будет вспомнить о давних увлечениях и хобби, мечтах, оставшихся в прошлом, или надеждах, которые когда-то не сбылись. Главное, в нужный момент услышать радость своего сердца - оно подскажет, что это ситуация важна, интересна и даже для чего-то необходима.',
    'Card 19': 'Направь свои силы на то, что для тебя важно. Чёткое понимание жизненных ценностей способствует формированию характера, контролю действий, желаний и, конечно же, решений. Это твой внутренний компас, по которому необходимо сверять все шаги. Если ты действительно хочешь осуществить свою мечту, она должна быть одним из наиболее приоритетных дел в твоем графике.',
    'Card 20': 'Остановись в суете поспешных мыслей. Рано делать выводы. Предварительно собери все частицы информации, разберись в их значении, осмысли и подтверди их. Заранее ты никогда не можешь знать, что тебе пригодится. Пробуй новое и жди, пока эти навыки и сведения не соединятся с другими и не принесут пользу.',
    'Card 21': 'Совершенствуй свои приемы, методы и инструменты в общении. Выражайся простыми и меткими словами. Крепко держи в голове образ своего послания и чётко выделяй в своей речи основную мысль. Она должна быть понятной и убедительной. Управляя своей речью, ты управляешь своими мыслями, а значит и жизнью.',
    'Card 22': 'Не суетись в беседах своих. Пусть каждое слово всегда будет плавно и спокойно, как течение воды в утренней тихой реке. Из глубины Души отправляй добрые слова своим близким. Твоё слово, идущее от сердца, облегчает боль, исцеляет и воодушевляет! Если твои мысли материальны, то слова есть сила, действие которой беспредельно.',
    'Card 23': 'У тебя есть все способности, чтобы достичь своей цели. В ситуации неопределённости ожидай лучшего. Стойко преодолевая боль перемен, продолжай упорно трудиться, когда остальные сдаются. Не нужно увязать в вещах, которые не можешь изменить.',
    'Card 24': 'Не жди, когда тебе откроют, позовут или предложат. Действуй сам! Проси. Не просят либо гордые, либо глупые. Правда, просить надо тоже умея: разумно, культурно и адекватно. Проси, но не злоупотребляй помощью. Может, не сразу, но со временем ты обретёшь желаемое. Проси знания и советы, связи и время. Обязательно используй содействие людей для созидания.',
    'Card 25': 'Очисти себя дисциплиной от всего лишнего. Настоящая дисциплина есть воплощение воли, то есть Духовного самообладания. Самоконтроль — столь же необходимое условие для достижения контакта с Богами и Предками, как и Вера. Единство силы и знаний – это то, что тебе нужно, чтобы менять себя и свою жизнь. ',
    'Card 26': 'Твоя сила лежит исключительно в труде и упорстве. Главное — верить и не опускать руки, а всё остальное получится. Ступай с высоко поднятой головой вершить свои славные деяния. Твоя воля способна превращать возможность в действительность. Ты потомок Древних Богов, а значит, ты можешь творить свой мир вокруг себя! ',
    'Card 27': 'Если ты хочешь, чтобы в мире воцарилось равновесие, стремись обрести  покой и гармонию в своем сердце и уме. Такие перемены нельзя ввести по наставлению, они должны прийти изнутри. Примирись с собой. Направляй свою волю на общие, всемирные цели. Нет лада в том, у кого в приоритете личная выгода. ',
    'Card 28': 'Грядёт время завершений начинаний. Очередной жизненный этап достиг своего предела. Прежние ориентиры исчерпали свою кладезь мудрости. Помни: за утратой всегда таятся новые возможности. Приготовься торить нехоженые тропы. Твои новые игры должны быть интереснее старых.',
    'Card 29': 'Проявляй больше упорства, самодисциплины и терпения. Если не можешь идти к цели, ползи к ней, если не можешь ползти - думай о ней. Все проблемы на своём пути нужно воспринимать как ступени по лестнице успеха. Жизнь полностью меняется, если в ней появляются смысл и цель. Всегда помни о том, ради чего ты встал на этот путь. В любой борьбе смысл даёт нам невероятную силу для прохождения тех или иных испытаний. В стремлении к своей цели каждый человек исполняет своё предназначение и обретает Высшую Духовную ценность.',
    'Card 30': 'Знай предел своих желаний и страстей, не переступай грань дозволенного. Во всех жизненных ситуациях лучше быть жаждущим, чем пресыщенным. Переизбыток – первый признак зависимости, он убивает вкус к жизни. Соблюдай чувство меры, и Мать-Природа дарует тебе жизненные силы.',
    'Card 31': 'Смотри вдаль, за границы шаблонного образа жизни, туда, где нет ограничений для твоего роста. Раскрой сознание для невероятных идей и смыслов бытия. Для твоей созидательной деятельности нет предела -  все пути открыты. Пора сделать решительный рывок. Не сопротивляйся переменам, новые горизонты ждут тебя!',
    'Card 32': 'Борись за свои интересы. В противном случае найдутся те, кто обязательно попытаются подстроить тебя под себя. Ты не обязан быть удобным и понятным для других. Всё, что ты обязан — это быть тем, кто ты есть, и раскрывать то индивидуальное, ценное и неповторимое, что есть в каждом из нас.',
    'Card 33': 'Просто продолжай действовать. Не думай слишком много о конечном результате и не привязывайся к воспоминаниям о прошлых достижениях. Трудности — это не повод сдаваться и опускать руки, а знак того, что ты идешь вперёд. В тот момент, когда ты находишься на пределе своих возможностей, происходят колоссальные перемены в твоём сознании. Душевная боль широко открывает сердце, чтобы исторгнуть камни прошлого и впустить туда Светлую Силу Природы и Вышних Сил.',
    'Card 34': 'Ищи людей со схожими интересами ради создания общих целей, чтобы затем породить единство действий. Великие и благие дела всегда сплачивают людей. Чувство сплочённости сотворит твою дорогу к успеху. Чтобы сотрудничество стало подлинным, оно должно выдерживать самые серьёзные испытания и не распасться.',
    'Card 35': 'Доведи свои дела до результата. Незавершённые процессы – это дыры, сквозь которые утекает резерв нашей жизненной силы. Необходимо собрать волю в кулак, просто взять и сделать то, что нужно! Еще один способ решения вопросов с незаконченными делами – это отказаться от них. Сними этот груз с Души – нет смысла таскать за собой то, что толком не делаешь. Ведь для того, что действительно важно, всегда найдётся и время, и желание.',
    'Card 36': 'Благодарность – это связующая нить с Вышними Силами. Это Духовная основа, что обращает проблемы – в дары, отрицание – в принятие, сомнения – в ясность, хаос – в порядок. Установи этот канал и тебе придут любые блага. Благодарность – это ключ к наполненной жизни. Всё должно быть в равновесии: как материальное не должно стоять над духовным, так и духовное не должно стоять над материальным.',
    'Card 37': 'Двигайся своей стезёй и не смотри на других. Сравнивай себя только с собой из вчерашнего дня. Найди себя там, где ещё не ступала нога обычных людей. Полагайся на собственные возможности, трезво оценивай перспективы и ресурсы, ставь перед собой реальные цели, которых можешь достичь своими силами. Пусть тебе тяжело в начале, но в конце ты будешь на такой вершине, которая не поддается большинству.',
    'Card 38': 'Снова открой в своей Душе глубочайший смысл ответственности перед миром – это означает ответственность перед своей миссией, Родом, Народом, Отчизной. Только ты творишь события в своей жизни. Воля сопровождается обязательствами перед Высшими Силами.',
    'Card 39': 'Найди самого опытного и взаимодействуй с ним, перенимай мудрые мысли, навыки, традиции и приёмы. Учись у того, кто обладает успешным опытом, у того, кто преуспел сам или помог другим. Говорить о победах может каждый, но вот показать своим примером  – это дорогого стоит.',
    'Card 40': 'Вложи свет своей Души в повседневные занятия. Ищи радость в самом процессе деятельности, а не в конечной цели. Твори и живи этим – это естественная возможность реализовать себя и раскрыть свои способности. Найди в себе силы углубиться в дело со всей Душой. Открой одну из возможностей полноценно ощущать жизнь и позволь миру насладиться твоим сиянием.',
    'Card 41': 'Выясни закономерность, корень и исходную точку события. Любая ситуация имеет ту ценность, которой ты её наделишь. Осуществление смысла всегда включает в себя принятие решения. Суть решения – применение имеющихся у тебя знаний на практике. Поступки определяют, кто ты есть.',
    'Card 42': 'Улучшай и умножай полученную в наследство мудрость. Старайся оставить после себя больше знаний и счастья, чем их было раньше – вот над чем необходимо трудиться. В делах праведных раскрывается Родовая память, ибо прошлое неразрывно связано с настоящим, из которого берёт начало будущее.',
    'Card 43': 'Познавай по крупицам Мудрость Предков с великим усердием, долготерпением, кропотливым созидательным трудом. Невозможно за единый раз осознать всё многообразие, заключённое в Древних Знаниях, и охватить своим взором Мироздание. Наследие прошлого всегда познавали, чтобы осознать свой Жизненный Путь и затем передать его потомкам.',
    'Card 44': 'Владей инициативой, поступай по собственному разумению, действуй по обстоятельствам. Познавай жизнь своим умом. Чужие цели не принесут улучшений в собственной жизни. Продираясь сквозь страх и лень, начни творить что-то совершенно новое или же завершать забытое старое.',
    'Card 45': 'Вера в собственные силы и в успех своих деяний – это первый шаг к пониманию своего предназначения. Трудись на благо и процветание своего Рода. Божественная связь начинается в кругу самых близких людей. Именно они несут для нас самые важные жизненные уроки и открывают неисчерпаемый источник Духовной Силы.',
    'Card 46': 'Воспринимай мир таким, какой он есть, через призму добра и чуткости, чтобы не озлобиться и не очерстветь. Наберись смелости идти на зов Души. Созидай по велению сердца, ибо сердце твоё - безграничный источник вдохновения и Божественной Силы. Чем шире оно открыто, тем больше Света из Высших Миров ты сможешь пропускать через себя.',
    'Card 47': 'Окажись в сердце Природы, останови ход мыслей и оглядись вокруг. Услышь прекрасную песнь Матери-Природы. Она – неиссякаемый источник целительных сил. Напитай свой Дух её красотой и радостью, изгоняя боль и хворь из Души и тела.',
    'Card 48': 'С сочувствием и мудростью поддерживай людей, помогающих себе самостоятельно. Милосердие и Вера во всеисцеляющие чувства Любви и Добра способны в будущем преобразить даже бесов. Эти качества готовят человека к служению другим людям, а также направляют его на путь творчества, который является по сути борьбой со злом и рассматривается как соучастие в деяниях для преображения мира.',
    'Card 49': 'Действуй прямо сейчас. Преграды, которые ты видишь перед собой – просто повод отложить момент, когда ты приступишь к воплощению задуманного. Не теряй время понапрасну, деяния, которые надлежит совершить, исполняй без промедления, но и без спешки. Созидай то, что в состоянии создать, а получится то, что предначертано Богами.',
};

const audioFiles = {
    'Card 1': 'media//01.mp3',
    'Card 2': 'media//02.mp3',
    'Card 3': 'media//03.mp3',
    'Card 4': 'media//04.mp3',
    'Card 5': 'media//05.mp3',
    'Card 6': 'media//06.mp3',
    'Card 7': 'media//07.mp3',
    'Card 8': 'media//08.mp3',
    'Card 9': 'media//09.mp3',
    'Card 10': 'media//10.mp3',
    'Card 11': 'media//11.mp3',
    'Card 12': 'media//12.mp3',
    'Card 13': 'media//13.mp3',
    'Card 14': 'media//14.mp3',
    'Card 15': 'media//15.mp3',
    'Card 16': 'media//16.mp3',
    'Card 17': 'media//17.mp3',
    'Card 18': 'media//18.mp3',
    'Card 19': 'media//19.mp3',
    'Card 20': 'media//20.mp3',
    'Card 21': 'media//21.mp3',
    'Card 22': 'media//22.mp3',
    'Card 23': 'media//23.mp3',
    'Card 24': 'media//24.mp3',
    'Card 25': 'media//25.mp3',
    'Card 26': 'media//26.mp3',
    'Card 27': 'media//27.mp3',
    'Card 28': 'media//28.mp3',
    'Card 29': 'media//29.mp3',
    'Card 30': 'media//30.mp3',
    'Card 31': 'media//31.mp3',
    'Card 32': 'media//32.mp3',
    'Card 33': 'media//33.mp3',
    'Card 34': 'media//34.mp3',
    'Card 35': 'media//35.mp3',
    'Card 36': 'media//36.mp3',
    'Card 37': 'media//37.mp3',
    'Card 38': 'media//38.mp3',
    'Card 39': 'media//39.mp3',
    'Card 40': 'media//40.mp3',
    'Card 41': 'media//41.mp3',
    'Card 42': 'media//42.mp3',
    'Card 43': 'media//43.mp3',
    'Card 44': 'media//44.mp3',
    'Card 45': 'media//45.mp3',
    'Card 46': 'media//46.mp3',
    'Card 47': 'media//47.mp3',
    'Card 48': 'media//48.mp3',
    'Card 49': 'media//49.mp3'
};

let currentAudioPath;

function getcard() {
    // Получаем данные о выбранных картах из localStorage
    console.log('Получаем данные о выбранных картах из localStorage');
    const flippedCardsData = localStorage.getItem('flippedCards');
    console.log('flippedCardsData from localStorage:', flippedCardsData);
    const flippedCards = JSON.parse(flippedCardsData);
    console.log('flippedCards:', flippedCards);

    // Отображаем выбранные карты на странице
    if (flippedCards && flippedCards.length === 4) {
        const firstCard = document.querySelector('.first-card');
        const secondCard = document.querySelector('.second-card');
        const thirdCard = document.querySelector('.third-card');
        const fourthCard = document.querySelector('.fourth-card');
        const firstworldsTextName = document.querySelector('.worlds-text-title');
        const firstworldsTextTitle = document.querySelector('.worlds-text-wish');
        const firstworldsTextAbout = document.querySelector('.worlds-text-about');

        // Создаем промисы для отслеживания загрузки изображений
        const promises = flippedCards.map(card => {
            return new Promise((resolve, reject) => {
                const img = new Image();
                img.onload = function() {
                    resolve(`<img src="${cardImages[`Card ${card}`]}" alt="Card ${card}">`);
                };
                img.onerror = function() {
                    reject(`Error loading image for Card ${card}`);
                };
                img.src = cardImages[`Card ${card}`];
            });
        });

        // Дожидаемся загрузки всех изображений
        Promise.all(promises)
            .then(images => {
                // Заполняем содержимое карт
                firstCard.innerHTML = images[0];
                secondCard.innerHTML = images[1];
                thirdCard.innerHTML = images[2];
                fourthCard.innerHTML = images[3];

                // console.log('выполнено6')
                // playSound1(`Card ${flippedCards[0]}`); 
                // console.log('выполнено опен 1')
                // Затемняем вторую, третью и четвертую карты
                secondCard.style.opacity = 0.5;
                thirdCard.style.opacity = 0.5;
                fourthCard.style.opacity = 0.5;

                // Добавляем значение из cardname в worldsTextTitle
                firstworldsTextName.textContent = cardname[`Card ${flippedCards[0]}`];
                firstworldsTextTitle.textContent = cardtitle[`Card ${flippedCards[0]}`];
                firstworldsTextAbout.textContent = cardabout[`Card ${flippedCards[0]}`];
            })
            .catch(error => {
                console.error(error);
            });
    }
}





function getcardsecond() {

    // Получаем данные о выбранных картах из localStorage
    console.log('Получаем данные о выбранных картах из localStorage');
    const flippedCardsData = localStorage.getItem('flippedCards');
    console.log('flippedCardsData from localStorage:', flippedCardsData);
    const flippedCards = JSON.parse(flippedCardsData);
    console.log('flippedCards:', flippedCards); // Добавляем этот console.log для вывода массива карт

    // Отображаем выбранные карты на странице
    if (flippedCards && flippedCards.length === 4) {
        const firstCard = document.querySelector('.first-card');
        const secondCard = document.querySelector('.second-card');
        const thirdCard = document.querySelector('.third-card');
        const fourthCard = document.querySelector('.fourth-card');
        const secondworldsTextName = document.querySelector('.worlds-text-title-yav');
        const secondworldsTextTitle = document.querySelector('.worlds-text-wish-yav');
        const secondworldsTextAbout = document.querySelector('.worlds-text-about-yav');

        // Заполняем содержимое карт
        firstCard.innerHTML = `<img src="${cardImages[`Card ${flippedCards[0]}`]}" alt="Card ${flippedCards[0]}">`;
        secondCard.innerHTML = `<img src="${cardImages[`Card ${flippedCards[1]}`]}" alt="Card ${flippedCards[1]}">`;
        thirdCard.innerHTML = `<img src="${cardImages[`Card ${flippedCards[2]}`]}" alt="Card ${flippedCards[2]}">`;
        fourthCard.innerHTML = `<img src="${cardImages[`Card ${flippedCards[3]}`]}" alt="Card ${flippedCards[3]}">`;

        

        // playSound2(`Card ${flippedCards[1]}`); 
        // console.log('выполнено 2 голос')

        // Затемняем вторую, третью и четвертую карты
        firstCard.style.opacity = 0.5;
        thirdCard.style.opacity = 0.5;
        fourthCard.style.opacity = 0.5;

        secondworldsTextName.textContent = cardname[`Card ${flippedCards[1]}`];
        secondworldsTextTitle.textContent = cardtitle[`Card ${flippedCards[1]}`];
        secondworldsTextAbout.textContent = cardabout[`Card ${flippedCards[1]}`];
        // Выводим описание по первой карте
        // const pageText = document.querySelector('.worlds-text');
        // pageText.textContent = `Описание по карте ${flippedCards[0]}`;
    }
}

function getcardthird() {
    // Получаем данные о выбранных картах из localStorage
    console.log('Получаем данные о выбранных картах из localStorage');
    const flippedCardsData = localStorage.getItem('flippedCards');
    console.log('flippedCardsData from localStorage:', flippedCardsData);
    const flippedCards = JSON.parse(flippedCardsData);
    console.log('flippedCards:', flippedCards); // Добавляем этот console.log для вывода массива карт

    // Отображаем выбранные карты на странице
    if (flippedCards && flippedCards.length === 4) {
        const firstCard = document.querySelector('.first-card');
        const secondCard = document.querySelector('.second-card');
        const thirdCard = document.querySelector('.third-card');
        const fourthCard = document.querySelector('.fourth-card');
        const thirdworldsTextName = document.querySelector('.worlds-text-title-slav');
        const thirdworldsTextTitle = document.querySelector('.worlds-text-wish-slav');
        const thirdworldsTextAbout = document.querySelector('.worlds-text-about-slav');


        // Заполняем содержимое карт
        firstCard.innerHTML = `<img src="${cardImages[`Card ${flippedCards[0]}`]}" alt="Card ${flippedCards[0]}">`;
        secondCard.innerHTML = `<img src="${cardImages[`Card ${flippedCards[1]}`]}" alt="Card ${flippedCards[1]}">`;
        thirdCard.innerHTML = `<img src="${cardImages[`Card ${flippedCards[2]}`]}" alt="Card ${flippedCards[2]}">`;
        fourthCard.innerHTML = `<img src="${cardImages[`Card ${flippedCards[3]}`]}" alt="Card ${flippedCards[3]}">`;
        // playSound3(`Card ${flippedCards[2]}`); 
        // Затемняем вторую, третью и четвертую карты
        firstCard.style.opacity = 0.5;
        secondCard.style.opacity = 0.5;
        fourthCard.style.opacity = 0.5;


        thirdworldsTextName.textContent = cardname[`Card ${flippedCards[2]}`];
        thirdworldsTextTitle.textContent = cardtitle[`Card ${flippedCards[2]}`];
        thirdworldsTextAbout.textContent = cardabout[`Card ${flippedCards[2]}`];
        // Выводим описание по первой карте
        // const pageText = document.querySelector('.worlds-text');
        // pageText.textContent = `Описание по карте ${flippedCards[0]}`;
    }
}

function getcardfourth() {
    // Получаем данные о выбранных картах из localStorage
    console.log('Получаем данные о выбранных картах из localStorage');
    const flippedCardsData = localStorage.getItem('flippedCards');
    console.log('flippedCardsData from localStorage:', flippedCardsData);
    const flippedCards = JSON.parse(flippedCardsData);
    console.log('flippedCards:', flippedCards); // Добавляем этот console.log для вывода массива карт

    // Отображаем выбранные карты на странице
    if (flippedCards && flippedCards.length === 4) {
        const firstCard = document.querySelector('.first-card');
        const secondCard = document.querySelector('.second-card');
        const thirdCard = document.querySelector('.third-card');
        const fourthCard = document.querySelector('.fourth-card');
        const fourthworldsTextName = document.querySelector('.worlds-text-title-prav');
        const fourthworldsTextTitle = document.querySelector('.worlds-text-wish-prav');
        const fourthworldsTextAbout = document.querySelector('.worlds-text-about-prav');

        // Заполняем содержимое карт
        firstCard.innerHTML = `<img src="${cardImages[`Card ${flippedCards[0]}`]}" alt="Card ${flippedCards[0]}">`;
        secondCard.innerHTML = `<img src="${cardImages[`Card ${flippedCards[1]}`]}" alt="Card ${flippedCards[1]}">`;
        thirdCard.innerHTML = `<img src="${cardImages[`Card ${flippedCards[2]}`]}" alt="Card ${flippedCards[2]}">`;
        fourthCard.innerHTML = `<img src="${cardImages[`Card ${flippedCards[3]}`]}" alt="Card ${flippedCards[3]}">`;
        // playSound4(`Card ${flippedCards[3]}`); 
        // Затемняем вторую, третью и четвертую карты
        firstCard.style.opacity = 0.5;
        thirdCard.style.opacity = 0.5;
        secondCard.style.opacity = 0.5;


        fourthworldsTextName.textContent = cardname[`Card ${flippedCards[3]}`];
        fourthworldsTextTitle.textContent = cardtitle[`Card ${flippedCards[3]}`];
        fourthworldsTextAbout.textContent = cardabout[`Card ${flippedCards[3]}`];

        // Выводим описание по первой карте
        // const pageText = document.querySelector('.worlds-text');
        // pageText.textContent = `Описание по карте ${flippedCards[0]}`;
    }
}


